Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.UpDirection Property
 The up direction of the analysis part (in the global coordinate system). The axis vector (connecting member end nodes) and the up direction vector define the local XY plane of the member. The local Z can be calculated as localZ = localX x UpDirection (cross product), and after this localY = localZ x localX (cross product).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector UpDirection { get; set; }
Public Property UpDirection As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace